; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v4)
		(pred_3 ?v8)
		(pred_2 ?v1)
		(pred_1 ?v1)
		(pred_5 ?v8 ?v1)
		(pred_4)
		(pred_6 ?v8))

   (:action op_2
       :parameters  (?v2 ?v6)
       :precondition (and (not-eq ?v2 ?v6) 
                          (pred_2 ?v2) (pred_2 ?v6) (pred_1 ?v2))
       :effect (and  (pred_1 ?v6)
		     (not (pred_1 ?v2))))


   (:action op_3
       :parameters (?v3 ?v5)
       :precondition  (and  (pred_3 ?v3) (pred_2 ?v5)
			    (pred_5 ?v3 ?v5) (pred_1 ?v5) (pred_4))
       :effect (and (pred_6 ?v3)
		    (not (pred_5 ?v3 ?v5)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v3  ?v5)
       :precondition  (and  (pred_3 ?v3) (pred_2 ?v5)
			    (pred_6 ?v3) (pred_1 ?v5))
       :effect (and (pred_5 ?v3 ?v5)
		    (pred_4)
		    (not (pred_6 ?v3)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_02 obj_03 obj_04 obj_01 
          obj_06 obj_05 
)
(:init
(pred_2 obj_02)
(pred_2 obj_03)
(pred_2 obj_04)
(pred_2 obj_01)
(pred_3 obj_06)
(pred_3 obj_05)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(pred_4)
(pred_5 obj_06 obj_04)
(pred_5 obj_05 obj_03)
(pred_1 obj_03)
)
(:goal
(and
(pred_5 obj_06 obj_01)
(pred_5 obj_05 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_06 obj_01) (pred_1 obj_02))
    (sometime-before  (pred_5 obj_05 obj_01) (pred_1 obj_02))
  )
)
)

; plan
1. (op_3 obj_05 obj_03)
   deleted: (pred_5 obj_05 obj_03) (pred_4)
   added: (pred_6 obj_05)
   goals met: 0 of 2
2. (op_2 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 0 of 2
3. (op_2 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 0 of 2
4. (op_1 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_04) (pred_4)
   goals met: 0 of 2
5. (op_3 obj_06 obj_04)
   deleted: (pred_5 obj_06 obj_04) (pred_4)
   added: (pred_6 obj_06)
   goals met: 0 of 2
6. (op_2 obj_04 obj_02)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_02)
   goals met: 0 of 2
7. (op_1 obj_06 obj_02)
   deleted: (pred_6 obj_06)
   added: (pred_5 obj_06 obj_02) (pred_4)
   goals met: 0 of 2
8. (op_2 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 0 of 2
9. (op_3 obj_05 obj_04)
   deleted: (pred_5 obj_05 obj_04) (pred_4)
   added: (pred_6 obj_05)
   goals met: 0 of 2
10. (op_2 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 0 of 2
11. (op_1 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_01) (pred_4)
   goals met: 1 of 2
12. (op_2 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 1 of 2
13. (op_3 obj_06 obj_02)
   deleted: (pred_5 obj_06 obj_02) (pred_4)
   added: (pred_6 obj_06)
   goals met: 1 of 2
14. (op_2 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 1 of 2
15. (op_1 obj_06 obj_01)
   deleted: (pred_6 obj_06)
   added: (pred_5 obj_06 obj_01) (pred_4)
   goals met: 2 of 2
